package com.atguigu.study02;
/*
 * 1.标识符：
 *  Java对各种变量、方法和类等要素命名时使用的字符序列称为标识符
 *  技巧————>凡是自己可以起名字的地方都叫标识符
 *     比如：类名、变量名、方法名、接口名、包名....
 * 2.标识符的命名规则
 *  >由26个英文字母大小写、0-9、_或$组成
 *  >数字不可以开头
 *  >不可以使用关键字和保留字，但能包含关键字和保留字
 *  >Java中严格区分大小写，长度无限制
 *  >标识符不能包含空格
 *
 * 如果不遵守上述规则编译无法通过
 *
 * 3.Java中的名称命名规范：
 *  包名：多单词组成时所有字母都小写 > xxxyyyzzz
 *  类名、接口名：多单词组成时，所有单词的首字母大写 > XxxYyyZzz
 *  变量名、方法名;多单词组成时，第一个单词首字母小写，第二个单词开始每个单词首字母大写 > xxxYyyZzz
 *  常量名：所有字母都大写，多单词时每个单词用下划线连接：XXX_YYY_ZZZ
 *
 * 注意1、在起名字时为了提高阅读性，要尽量有意义，“见名知意”
 * 注意2、java采用unicode字符集，因此标识符也可以使用汉字声明，但是不建议使用
 *
 *
 * java关键字的使用
 * 定义：被java语言赋予了特殊含义，用做专门用途的字符串（单词）
 * 特点：关键字中的所有字母都为小写
 *
 * */
/**
 * @author philo
 * @Description
 * @email 3424586889@qq.com
 * @Date 2022-07-03-14:53
 */
public class Identifier01 {
}
